app/controllers/account_controller.rb

SELECT * FROM "pictures" WHERE ("pictures".relationship_id = 1)
SELECT * FROM "users" WHERE (created_at > '2009-05-26')
SELECT * FROM "relationships" WHERE (created_at > '2009-05-26')
INSERT INTO "users" ("salt", "updated_at", "profile_picture_content_type", "crypted_password", "remember_token_expires_at", "profile_picture_file_name", "profile_picture_file_size", "remember_token", "first_name", "login", "last_name", "email", "created_at") VALUES('1d4a9928858a3386a32c9832e1756bcd8ef923e9', '2009-06-02 21:12:03', NULL, '5ef0066fb932d380f48acd2361349a183062e558', NULL, NULL, NULL, NULL, 'Super', 'superman', 'Man', 'superman@gmail.com', '2009-06-02 21:12:03')
---
  def signup
    @recent_users = User.find(:all, :conditions=>["created_at > ?", Date.today - 7.days]).select{|u| !u.profile_picture_file_name.nil?}.first 5
    @recent_relationships = Relationship.find(:all, :conditions=>["created_at > ?", Date.today - 7.days]).select{|r| !r.pictures.blank? }.first 5


    @user = User.new(params[:user])
    return unless request.post?
    @user.save!

UPDATE "users" SET "remember_token" = NULL, "remember_token_expires_at" = NULL, "updated_at" = '2009-06-05 03:50:30' WHERE "id" = 9
---
  def logout
    self.current_user.forget_me if logged_in?
    cookies.delete :auth_token
    reset_session
    flash[:notice] = "You have been logged out."
    current_user.last_logout = Time.now
    current_user.save