app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.find(:all, :conditions => ["relationship_id = ?", params[:relationship_id]])

    @relationship = Relationship.find(params[:relationship_id])
---
SELECT * FROM "pictures" WHERE (relationship_id = '2')
SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)

  def show
    @picture = Picture.find(params[:id])
    @relationship = Relationship.find(params[:relationship_id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)
SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)

  def new
    @picture = Picture.new
    @relationship = Relationship.find(params[:relationship_id])
---
SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)

  def edit
    @picture = Picture.find(params[:id])
    @relationship = Relationship.find(params[:relationship_id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)
SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)

  def create
    @picture = Picture.new(params[:picture])
    @relationship = Relationship.find(params[:relationship_id])

    @picture.relationship_id = @relationship.id



    respond_to do |format|
      if @picture.save
---
SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)
INSERT INTO "pictures" ("image_file_size", "integer", "updated_at", "title", "image_content_type", "relationship_id", "image_file_name", "string", "created_at") VALUES(NULL, NULL, '2009-05-29 19:56:35', 'Sailing', NULL, 1, NULL, NULL, '2009-05-29 19:56:35')

  def update
    @picture = Picture.find(params[:id])

    respond_to do |format|
      if @picture.update_attributes(params[:picture])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)
UPDATE "pictures" SET "image_content_type" = 'image/jpeg', "image_file_name" = 'banner.jpg', "image_file_size" = 28783, "updated_at" = '2009-05-29 19:59:22' WHERE "id" = 1

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 3)
DELETE FROM "pictures" WHERE "id" = 3