app/controllers/relationships_controller.rb

SELECT * FROM "relationships" WHERE ("relationships".second_user_id = 3)
SELECT * FROM "users" WHERE ("users"."id" = '--- :user_id
SELECT * FROM "relationships"
---
  def index
    if params[:user_id]
      @relationships = User.find(params[:user_id]).relationships
    else
      @relationships = Relationship.all

SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)
---
  def show
    @relationship = Relationship.find(params[:id])

SELECT * FROM "users"
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    @relationship = Relationship.new

    @relationship.first_user = current_user
    @relationship.second_user = User.find(params[:second_user])

SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)
---
  def edit
    @relationship = Relationship.find(params[:id])

INSERT INTO "relationships" ("name", "updated_at", "first_user_id", "second_user_id", "description", "created_at") VALUES('My first GF!!!!!!!!!!!!!', '2009-06-04 20:27:34', 9, 2, 'Holy crap! Her name is Hott Chick!', '2009-06-04 20:27:34')
---
  def create
    @relationship = Relationship.new(params[:relationship])

    respond_to do |format|
      if @relationship.save

SELECT * FROM "relationships" WHERE ("relationships"."id" = 1)
---
  def update
    @relationship = Relationship.find(params[:id])