app/controllers/user_search_controller.rb

  def search
    @users = User.find_with_ferret(params[:query], :per_page => @per_page)
---
SELECT * FROM "users" WHERE (users.id in ('6'))