app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "profile_picture_content_type", "crypted_password", "remember_token_expires_at", "profile_picture_file_name", "profile_picture_file_size", "remember_token", "first_name", "login", "last_name", "email", "created_at") VALUES('788a7ff17d9027a47e0d700311e32610f6c969dd', '2009-06-05 22:37:40', NULL, 'd132aae423f3698c2d18e3de4dff1087413dd32f', NULL, NULL, NULL, NULL, 'OMGALONGFIRSTNAME!', 'ihaveareallylongloginnamesoscrewyou', 'Blah', 'blah@blahblha.com', '2009-06-05 22:37:40')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "profile_picture_file_name" = 'coffeehearts.jpg', "profile_picture_file_size" = 117752, "updated_at" = '2009-06-02 21:12:24', "profile_picture_content_type" = 'image/jpeg' WHERE "id" = 9
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])